<a href="https://colab.research.google.com/github/AnnLivio/MySQL_Projects/blob/main/Baby_Names.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Baby Name Trend Analysis
View trends in baby name popularity based on US social security data from 1980-2010.
+ Libraries: SQLite, Pandas.
+ Origen: https://app.mavenanalytics.io/guided-projects/f71c0a2b-05f4-43fe-a80c-8f3f86964ccc
+ Guided Project from Maven Analytics for MySQL.

In [1]:
# Import libraries
import sqlite3
import csv
import pandas as pd

**Create cursor and conexion**

In [2]:
con = sqlite3.connect("baby_names.db")
cur = con.cursor()

In [4]:
# Load sql extension to make queries
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [5]:
%sql sqlite:///baby_names.db

In [6]:
# It contains the table description
bn = pd.read_csv("/content/drive/MyDrive/Colab Notebooks/baby_names_db_data_dictionary.csv")
bn

     Table   Field                                        Description
0    names   State    State (abbreviation) where the babies were born
1    names  Gender                      Gender of the babies at birth
2    names    Year                          Year the babies were born
3    names    Name                           Name given to the babies
4    names  Births  Number of babies given a name for a specific s...
5  regions   State          State (abbreviation) in the United States
6  regions  Region  Region of the United States that the state is ...

**Create tables Names and Regions**

In [7]:
# Create names table
%%sql CREATE TABLE names (
    State CHAR(2),
    Gender CHAR(1),
    Year INT,
    Name VARCHAR(45),
    Births INT);

 * sqlite:///baby_names.db
Done.

[]

In [35]:
# Create Region Table
%%sql CREATE TABLE regions (
      State CHAR(2),
      Region VARCHAR(45)
      );

 * sqlite:///baby_names.db
Done.

[]

In [36]:
# Insert values in regions table
%%sql
INSERT INTO regions VALUES ('AL', 'South'),
('AK', 'Pacific'),('AZ', 'Mountain'),('AR', 'South'),
('CA', 'Pacific'),('CO', 'Mountain'),('CT', 'New_England'),
('DC', 'Mid_Atlantic'),('DE', 'South'),('FL', 'South'),
('GA', 'South'),('HI', 'Pacific'),('ID', 'Mountain'),
('IL', 'Midwest'),('IN', 'Midwest'),('IA', 'Midwest'),
('KS', 'Midwest'),('KY', 'South'),('LA', 'South'),
('ME', 'New_England'),('MD', 'South'),('MA', 'New_England'),
('MN', 'Midwest'),('MS', 'South'),('MO', 'Midwest'),
('MT', 'Mountain'),('NE', 'Midwest'),('NV', 'Mountain'),
('NH', 'New England'),('NJ', 'Mid_Atlantic'),('NM', 'Mountain'),
('NY', 'Mid_Atlantic'),('NC', 'South'),('ND', 'Midwest'),
('OH', 'Midwest'),('OK', 'South'),('OR', 'Pacific'),
('PA', 'Mid_Atlantic'),('RI', 'New_England'),('SC', 'South'),
('SD', 'Midwest'),('TN', 'South'),('TX', 'South'),
('UT', 'Mountain'),('VT', 'New_England'),('VA', 'South'),
('WA', 'Pacific'),('WV', 'South'),('WI', 'Midwest'),
('WY', 'Mountain');

 * sqlite:///baby_names.db
50 rows affected.

[]

In [42]:
# Insert MI state
%%sql INSERT INTO regions VALUES ('MI', 'Midwest');

 * sqlite:///baby_names.db
1 rows affected.

[]

In [44]:
# Normalize New England
%%sql UPDATE regions SET Region = 'New_England' WHERE
    Region = 'New England';

 * sqlite:///baby_names.db
1 rows affected.

[]

**Import names data**

In [9]:
# import table CHEESE PRODUCTION
cols = ["State", "Gender", "Year", "Name", "Births"]
df= pd.read_csv("/content/drive/MyDrive/Colab Notebooks/names_data.csv", header=None, names=cols)

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2212361 entries, 0 to 2212360
Data columns (total 5 columns):
 #   Column  Dtype
---  ------  -----
 0   State   object
 1   Gender  object
 2   Year    int64
 3   Name    object
 4   Births  int64
dtypes: int64(2), object(3)
memory usage: 84.4+ MB

In [11]:
#Divide the dataset because is too large
# 35,000 is the max for now, i don't know

# j = df Lenght
j = 2212360
i = 0

# While loop to append data by 35000 records each time
while j >= 35000:
  df_new = df.iloc[i:i+35000,]
  # Append df_new to table "names"
  df_new.to_sql("names", con, if_exists='append', index=False, method="multi")
  i += 35000
  j -= 35000

# Append the last records
df_new = df.iloc[i:2212361,]
df_new.to_sql("names", con, if_exists='append', index=False, method="multi")

7361

In [12]:
%sql SELECT COUNT(*) FROM names;

 * sqlite:///baby_names.db
Done.

[(2212361,)]

In [46]:
del df_new
del df

In [13]:
#Show the table schema
%sql PRAGMA table_info("names")

 * sqlite:///baby_names.db
Done.

[(0, 'State', 'CHAR(2)', 0, None, 0),
 (1, 'Gender', 'CHAR(1)', 0, None, 0),
 (2, 'Year', 'INT', 0, None, 0),
 (3, 'Name', 'VARCHAR(45)', 0, None, 0),
 (4, 'Births', 'INT', 0, None, 0)]

## Task 1:

Find the overall most popular girl and boy names and show how they have changed in popularity rankings over the years.

In [14]:
# Girls most popular names
%%sql
  SELECT Name, SUM(Births) as num_babies
  FROM names
  WHERE Gender = 'F'
  GROUP BY Name
  ORDER BY num_babies DESC
  Limit 5;

 * sqlite:///baby_names.db
Done.

[('Jessica', 863121),
 ('Ashley', 786945),
 ('Jennifer', 652244),
 ('Sarah', 621174),
 ('Amanda', 607253)]

In [15]:
# Boys most popular names
%%sql
  SELECT Name, SUM(Births) as num_babies
  FROM names
  WHERE Gender = 'M'
  GROUP BY Name
  ORDER BY num_babies DESC
  Limit 5;

 * sqlite:///baby_names.db
Done.

[('Michael', 1376418),
 ('Christopher', 1118253),
 ('Matthew', 1031984),
 ('Joshua', 957518),
 ('Daniel', 821281)]

### The most popular name over from 1980 to 2010 for girls is `Jessica` and for boys is `Michael`.

In [16]:
# Jessica changes in popularity ranking over the years
%%sql
  SELECT Year, Name, popularity
  FROM(
  WITH girl_names AS(
    SELECT Year, Name, SUM(Births) as num_babies
    FROM names
    WHERE Gender = 'F'
    GROUP BY Year, Name)
  SELECT Year, Name,
      ROW_NUMBER() OVER(PARTITION BY Year
                        ORDER BY num_babies DESC) as popularity
  FROM girl_names) girl_rank
  WHERE Name = 'Jessica';

 * sqlite:///baby_names.db
Done.

[(1980, 'Jessica', 3),
 (1981, 'Jessica', 2),
 (1982, 'Jessica', 2),
 (1983, 'Jessica', 2),
 (1984, 'Jessica', 2),
 (1985, 'Jessica', 1),
 (1986, 'Jessica', 1),
 (1987, 'Jessica', 1),
 (1988, 'Jessica', 1),
 (1989, 'Jessica', 1),
 (1990, 'Jessica', 1),
 (1991, 'Jessica', 2),
 (1992, 'Jessica', 2),
 (1993, 'Jessica', 1),
 (1994, 'Jessica', 1),
 (1995, 'Jessica', 1),
 (1996, 'Jessica', 2),
 (1997, 'Jessica', 2),
 (1998, 'Jessica', 8),
 (1999, 'Jessica', 9),
 (2000, 'Jessica', 8),
 (2001, 'Jessica', 11),
 (2002, 'Jessica', 16),
 (2003, 'Jessica', 18),
 (2004, 'Jessica', 21),
 (2005, 'Jessica', 27),
 (2006, 'Jessica', 32),
 (2007, 'Jessica', 42),
 (2008, 'Jessica', 60),
 (2009, 'Jessica', 78)]

In [19]:
# Michael changes in popularity ranking over the years
%%sql
  SELECT Year, Name, popularity
  FROM(
  WITH boy_names AS(
    SELECT Year, Name, SUM(Births) as num_babies
    FROM names
    WHERE Gender = 'M'
    GROUP BY Year, Name)
  SELECT Year, Name,
      ROW_NUMBER() OVER(PARTITION BY Year
                        ORDER BY num_babies DESC) as popularity
  FROM boy_names) boy_rank
  WHERE Name = 'Michael';

 * sqlite:///baby_names.db
Done.

[(1980, 'Michael', 1),
 (1981, 'Michael', 1),
 (1982, 'Michael', 1),
 (1983, 'Michael', 1),
 (1984, 'Michael', 1),
 (1985, 'Michael', 1),
 (1986, 'Michael', 1),
 (1987, 'Michael', 1),
 (1988, 'Michael', 1),
 (1989, 'Michael', 1),
 (1990, 'Michael', 1),
 (1991, 'Michael', 1),
 (1992, 'Michael', 1),
 (1993, 'Michael', 1),
 (1994, 'Michael', 1),
 (1995, 'Michael', 1),
 (1996, 'Michael', 1),
 (1997, 'Michael', 1),
 (1998, 'Michael', 1),
 (1999, 'Michael', 2),
 (2000, 'Michael', 2),
 (2001, 'Michael', 2),
 (2002, 'Michael', 2),
 (2003, 'Michael', 2),
 (2004, 'Michael', 2),
 (2005, 'Michael', 2),
 (2006, 'Michael', 2),
 (2007, 'Michael', 2),
 (2008, 'Michael', 2),
 (2009, 'Michael', 3)]

## Task 2
Find the names with the biggest jumps in popularity from the first year of the data set to the last year

In [20]:
%%sql
  WITH all_names AS(
    SELECT Year, Name, SUM(Births) as num_babies
    FROM names
    GROUP BY Year, Name),

-- Ranking name for 1980
  older AS(
    SELECT Year, Name,
                  ROW_NUMBER() OVER(PARTITION BY Year ORDER BY num_babies DESC) as popularity_o
            FROM all_names
            WHERE Year = 1980),
-- Ranking name for 2009
  recent AS(
    SELECT Year, Name,
      ROW_NUMBER() OVER(PARTITION BY Year ORDER BY num_babies DESC) as popularity_p
      FROM all_names
      WHERE Year = 2009)

  SELECT Name, popularity_o as rank_1980, popularity_p as rank_2009, (popularity_p - popularity_o) as jump
  FROM (SELECT o.Name, o.popularity_o, r.popularity_p
        FROM older o
        INNER JOIN recent r
        ON o.Name = r.Name) rank
  ORDER BY jump
  LIMIT 10;

 * sqlite:///baby_names.db
Done.

[('Skylar', 5667, 313, -5354),
 ('Rylan', 5601, 320, -5281),
 ('Rowan', 5595, 445, -5150),
 ('Colton', 5103, 149, -4954),
 ('Aidan', 4995, 109, -4886),
 ('Lexi', 5415, 537, -4878),
 ('Macy', 5440, 571, -4869),
 ('Kyler', 5370, 511, -4859),
 ('Norah', 5519, 672, -4847),
 ('Tate', 5707, 901, -4806)]

# Compare popularity across decades

## Task 1
For each year, return the 3 most popular girl names and 3 most popular boy names

In [30]:
%%sql
  WITH all_names AS(
            SELECT Year, Name, Gender, SUM(Births) as num_babies
            FROM names
            GROUP BY Year, Name, Gender
  ),
  ranking_names AS(
            SELECT Year, Name, Gender,
              ROW_NUMBER() OVER(PARTITION BY Year, Gender ORDER BY num_babies DESC) as popularity_g
            FROM all_names
  )

  SELECT * FROM ranking_names
  WHERE popularity_g <= 3
  ORDER BY Year, Gender, popularity_g;

 * sqlite:///baby_names.db
Done.

[(1980, 'Jennifer', 'F', 1),
 (1980, 'Amanda', 'F', 2),
 (1980, 'Jessica', 'F', 3),
 (1980, 'Michael', 'M', 1),
 (1980, 'Christopher', 'M', 2),
 (1980, 'Jason', 'M', 3),
 (1981, 'Jennifer', 'F', 1),
 (1981, 'Jessica', 'F', 2),
 (1981, 'Amanda', 'F', 3),
 (1981, 'Michael', 'M', 1),
 (1981, 'Christopher', 'M', 2),
 (1981, 'Matthew', 'M', 3),
 (1982, 'Jennifer', 'F', 1),
 (1982, 'Jessica', 'F', 2),
 (1982, 'Amanda', 'F', 3),
 (1982, 'Michael', 'M', 1),
 (1982, 'Christopher', 'M', 2),
 (1982, 'Matthew', 'M', 3),
 (1983, 'Jennifer', 'F', 1),
 (1983, 'Jessica', 'F', 2),
 (1983, 'Amanda', 'F', 3),
 (1983, 'Michael', 'M', 1),
 (1983, 'Christopher', 'M', 2),
 (1983, 'Matthew', 'M', 3),
 (1984, 'Jennifer', 'F', 1),
 (1984, 'Jessica', 'F', 2),
 (1984, 'Ashley', 'F', 3),
 (1984, 'Michael', 'M', 1),
 (1984, 'Christopher', 'M', 2),
 (1984, 'Matthew', 'M', 3),
 (1985, 'Jessica', 'F', 1),
 (1985, 'Ashley', 'F', 2),
 (1985, 'Jennifer', 'F', 3),
 (1985, 'Michael', 'M', 1),
 (1985, 'Christopher', 'M', 2),
 (1985, 'Matthew', 'M', 3),
 (1986, 'Jessica', 'F', 1),
 (1986, 'Ashley', 'F', 2),
 (1986, 'Amanda', 'F', 3),
 (1986, 'Michael', 'M', 1),
 (1986, 'Christopher', 'M', 2),
 (1986, 'Matthew', 'M', 3),
 (1987, 'Jessica', 'F', 1),
 (1987, 'Ashley', 'F', 2),
 (1987, 'Amanda', 'F', 3),
 (1987, 'Michael', 'M', 1),
 (1987, 'Christopher', 'M', 2),
 (1987, 'Matthew', 'M', 3),
 (1988, 'Jessica', 'F', 1),
 (1988, 'Ashley', 'F', 2),
 (1988, 'Amanda', 'F', 3),
 (1988, 'Michael', 'M', 1),
 (1988, 'Christopher', 'M', 2),
 (1988, 'Matthew', 'M', 3),
 (1989, 'Jessica', 'F', 1),
 (1989, 'Ashley', 'F', 2),
 (1989, 'Brittany', 'F', 3),
 (1989, 'Michael', 'M', 1),
 (1989, 'Christopher', 'M', 2),
 (1989, 'Matthew', 'M', 3),
 (1990, 'Jessica', 'F', 1),
 (1990, 'Ashley', 'F', 2),
 (1990, 'Brittany', 'F', 3),
 (1990, 'Michael', 'M', 1),
 (1990, 'Christopher', 'M', 2),
 (1990, 'Matthew', 'M', 3),
 (1991, 'Ashley', 'F', 1),
 (1991, 'Jessica', 'F', 2),
 (1991, 'Brittany', 'F', 3),
 (1991, 'Michael', 'M', 1),
 (1991, 'Christopher', 'M', 2),
 (1991, 'Matthew', 'M', 3),
 (1992, 'Ashley', 'F', 1),
 (1992, 'Jessica', 'F', 2),
 (1992, 'Amanda', 'F', 3),
 (1992, 'Michael', 'M', 1),
 (1992, 'Christopher', 'M', 2),
 (1992, 'Matthew', 'M', 3),
 (1993, 'Jessica', 'F', 1),
 (1993, 'Ashley', 'F', 2),
 (1993, 'Sarah', 'F', 3),
 (1993, 'Michael', 'M', 1),
 (1993, 'Christopher', 'M', 2),
 (1993, 'Matthew', 'M', 3),
 (1994, 'Jessica', 'F', 1),
 (1994, 'Ashley', 'F', 2),
 (1994, 'Emily', 'F', 3),
 (1994, 'Michael', 'M', 1),
 (1994, 'Christopher', 'M', 2),
 (1994, 'Matthew', 'M', 3),
 (1995, 'Jessica', 'F', 1),
 (1995, 'Ashley', 'F', 2),
 (1995, 'Emily', 'F', 3),
 (1995, 'Michael', 'M', 1),
 (1995, 'Matthew', 'M', 2),
 (1995, 'Christopher', 'M', 3),
 (1996, 'Emily', 'F', 1),
 (1996, 'Jessica', 'F', 2),
 (1996, 'Ashley', 'F', 3),
 (1996, 'Michael', 'M', 1),
 (1996, 'Matthew', 'M', 2),
 (1996, 'Jacob', 'M', 3),
 (1997, 'Emily', 'F', 1),
 (1997, 'Jessica', 'F', 2),
 (1997, 'Ashley', 'F', 3),
 (1997, 'Michael', 'M', 1),
 (1997, 'Jacob', 'M', 2),
 (1997, 'Matthew', 'M', 3),
 (1998, 'Emily', 'F', 1),
 (1998, 'Hannah', 'F', 2),
 (1998, 'Samantha', 'F', 3),
 (1998, 'Michael', 'M', 1),
 (1998, 'Jacob', 'M', 2),
 (1998, 'Matthew', 'M', 3),
 (1999, 'Emily', 'F', 1),
 (1999, 'Hannah', 'F', 2),
 (1999, 'Alexis', 'F', 3),
 (1999, 'Jacob', 'M', 1),
 (1999, 'Michael', 'M', 2),
 (1999, 'Matthew', 'M', 3),
 (2000, 'Emily', 'F', 1),
 (2000, 'Hannah', 'F', 2),
 (2000, 'Madison', 'F', 3),
 (2000, 'Jacob', 'M', 1),
 (2000, 'Michael', 'M', 2),
 (2000, 'Matthew', 'M', 3),
 (2001, 'Emily', 'F', 1),
 (2001, 'Madison', 'F', 2),
 (2001, 'Hannah', 'F', 3),
 (2001, 'Jacob', 'M', 1),
 (2001, 'Michael', 'M', 2),
 (2001, 'Matthew', 'M', 3),
 (2002, 'Emily', 'F', 1),
 (2002, 'Madison', 'F', 2),
 (2002, 'Hannah', 'F', 3),
 (2002, 'Jacob', 'M', 1),
 (2002, 'Michael', 'M', 2),
 (2002, 'Joshua', 'M', 3),
 (2003, 'Emily', 'F', 1),
 (2003, 'Emma', 'F', 2),
 (2003, 'Madison', 'F', 3),
 (2003, 'Jacob', 'M', 1),
 (2003, 'Michael', 'M', 2),
 (2003, 'Joshua', 'M', 3),
 (2004, 'Emily', 'F', 1),
 (2004, 'Emma', 'F', 2),
 (2004, 'Madison', 'F', 3),
 (2004, 'Jacob', 'M', 1),
 (2004, 'Michael', 'M', 2),
 (2004, 'Joshua', 'M', 3),
 (2005, 'Emily', 'F', 1),
 (2005, 'Emma', 'F', 2),
 (2005, 'Madison', 'F', 3),
 (2005, 'Jacob', 'M', 1),
 (2005, 'Michael', 'M', 2),
 (2005, 'Joshua', 'M', 3),
 (2006, 'Emily', 'F', 1),
 (2006, 'Emma', 'F', 2),
 (2006, 'Madison', 'F', 3),
 (2006, 'Jacob', 'M', 1),
 (2006, 'Michael', 'M', 2),
 (2006, 'Joshua', 'M', 3),
 (2007, 'Emily', 'F', 1),
 (2007, 'Isabella', 'F', 2),
 (2007, 'Emma', 'F', 3),
 (2007, 'Jacob', 'M', 1),
 (2007, 'Michael', 'M', 2),
 (2007, 'Ethan', 'M', 3),
 (2008, 'Emma', 'F', 1),
 (2008, 'Isabella', 'F', 2),
 (2008, 'Emily', 'F', 3),
 (2008, 'Jacob', 'M', 1),
 (2008, 'Michael', 'M', 2),
 (2008, 'Ethan', 'M', 3),
 (2009, 'Isabella', 'F', 1),
 (2009, 'Emma', 'F', 2),
 (2009, 'Olivia', 'F', 3),
 (2009, 'Jacob', 'M', 1),
 (2009, 'Ethan', 'M', 2),
 (2009, 'Michael', 'M', 3)]

## Task 2
For each decade, return the 3 most popular girl names and 3 most popular boy names

In [34]:
%%sql
  WITH names_by_decade AS(
            SELECT
              (CASE when Year between 1980 and 1989 then '1980-1989'
                    when Year between 1990 and 1999 then '1990-1999'
                    when Year between 2000 and 2009 then '2000-2009'
                    else 'None'
              END) as Decade,
              Name, Gender, SUM(Births) as num_babies
            FROM names
            GROUP BY Decade, Name, Gender
  ),
  ranking_names AS(
            SELECT Decade, Name, Gender,
              ROW_NUMBER() OVER(PARTITION BY decade, Gender ORDER BY num_babies DESC) as Popularity
            FROM names_by_decade
  )

SELECT Decade, Name, Gender, Popularity
FROM ranking_names
WHERE popularity <= 3
GROUP BY Decade, Gender, Popularity;

 * sqlite:///baby_names.db
Done.

[('1980-1989', 'Jessica', 'F', 1),
 ('1980-1989', 'Jennifer', 'F', 2),
 ('1980-1989', 'Amanda', 'F', 3),
 ('1980-1989', 'Michael', 'M', 1),
 ('1980-1989', 'Christopher', 'M', 2),
 ('1980-1989', 'Matthew', 'M', 3),
 ('1990-1999', 'Jessica', 'F', 1),
 ('1990-1999', 'Ashley', 'F', 2),
 ('1990-1999', 'Emily', 'F', 3),
 ('1990-1999', 'Michael', 'M', 1),
 ('1990-1999', 'Christopher', 'M', 2),
 ('1990-1999', 'Matthew', 'M', 3),
 ('2000-2009', 'Emily', 'F', 1),
 ('2000-2009', 'Madison', 'F', 2),
 ('2000-2009', 'Emma', 'F', 3),
 ('2000-2009', 'Jacob', 'M', 1),
 ('2000-2009', 'Michael', 'M', 2),
 ('2000-2009', 'Joshua', 'M', 3)]

# Compare popularity across regions
## Task 1
Return the number of babies born in each of the six regions (NOTE: The state of MI should be in the Midwest region)

In [45]:
%%sql
  SELECT r.Region, SUM(n.Births) as num_babies
  FROM names n
  INNER JOIN regions r
  ON n.State = r.State
  GROUP BY r.Region
  ORDER BY num_babies DESC;

 * sqlite:///baby_names.db
Done.

[('South', 34219920),
 ('Midwest', 22676130),
 ('Pacific', 17540716),
 ('Mid_Atlantic', 13742667),
 ('Mountain', 6282217),
 ('New_England', 4269213)]

## Task 2
Return the 3 most popular girl names and 3 most popular boy names within each region

In [47]:
%%sql
  WITH names_by_region AS(
            SELECT r.Region, n.Name, n.Gender, SUM(n.Births) as num_babies
            FROM names n
            INNER JOIN regions r
            ON n.State = r.State
            GROUP BY r.Region, n.Name, n.Gender
  ),
  ranking_names AS(
            SELECT Region, Name, Gender,
              ROW_NUMBER() OVER(PARTITION BY Region, Gender ORDER BY num_babies DESC) as Popularity
            FROM names_by_region
  )

SELECT Region, Name, Gender, Popularity
FROM ranking_names
WHERE popularity <= 3
GROUP BY Region, Gender, Popularity;

 * sqlite:///baby_names.db
Done.

[('Mid_Atlantic', 'Jessica', 'F', 1),
 ('Mid_Atlantic', 'Ashley', 'F', 2),
 ('Mid_Atlantic', 'Jennifer', 'F', 3),
 ('Mid_Atlantic', 'Michael', 'M', 1),
 ('Mid_Atlantic', 'Matthew', 'M', 2),
 ('Mid_Atlantic', 'Christopher', 'M', 3),
 ('Midwest', 'Jessica', 'F', 1),
 ('Midwest', 'Ashley', 'F', 2),
 ('Midwest', 'Sarah', 'F', 3),
 ('Midwest', 'Michael', 'M', 1),
 ('Midwest', 'Matthew', 'M', 2),
 ('Midwest', 'Joshua', 'M', 3),
 ('Mountain', 'Jessica', 'F', 1),
 ('Mountain', 'Ashley', 'F', 2),
 ('Mountain', 'Sarah', 'F', 3),
 ('Mountain', 'Michael', 'M', 1),
 ('Mountain', 'Joshua', 'M', 2),
 ('Mountain', 'Christopher', 'M', 3),
 ('New_England', 'Jessica', 'F', 1),
 ('New_England', 'Sarah', 'F', 2),
 ('New_England', 'Emily', 'F', 3),
 ('New_England', 'Michael', 'M', 1),
 ('New_England', 'Matthew', 'M', 2),
 ('New_England', 'Christopher', 'M', 3),
 ('Pacific', 'Jessica', 'F', 1),
 ('Pacific', 'Jennifer', 'F', 2),
 ('Pacific', 'Ashley', 'F', 3),
 ('Pacific', 'Michael', 'M', 1),
 ('Pacific', 'Christopher', 'M', 2),
 ('Pacific', 'Daniel', 'M', 3),
 ('South', 'Ashley', 'F', 1),
 ('South', 'Jessica', 'F', 2),
 ('South', 'Jennifer', 'F', 3),
 ('South', 'Christopher', 'M', 1),
 ('South', 'Michael', 'M', 2),
 ('South', 'Joshua', 'M', 3)]

# Explore unique names in the dataset
## Task 1
Find the 10 most popular androgynous names (names given to both females and males)

In [52]:
%%sql
  SELECT Name, COUNT(DISTINCT(Gender)) as count_g, SUM(Births) as num_babies
  FROM names
  GROUP BY Name
  HAVING count_g = 2
  ORDER BY num_babies DESC
  LIMIT 10;

 * sqlite:///baby_names.db
Done.

[('Michael', 2, 1382856),
 ('Christopher', 2, 1122213),
 ('Matthew', 2, 1034494),
 ('Joshua', 2, 960170),
 ('Jessica', 2, 865046),
 ('Daniel', 2, 824208),
 ('David', 2, 819479),
 ('Ashley', 2, 792865),
 ('James', 2, 766789),
 ('Andrew', 2, 761824)]

## Task 2
Find the length of the shortest and longest names, and identify the most popular short names (those with the fewest characters) and long names (those with the most characters)

In [55]:
%%sql SELECT MIN(LENGTH(Name)), MAX(LENGTH(Name)) FROM names;

 * sqlite:///baby_names.db
Done.

[(2, 15)]

In [85]:
%%sql
  WITH length_names AS(
    SELECT Name, length(Name) as length_name, SUM(Births) as num_babies
    FROM names
    GROUP BY Name, length_name
    HAVING LENGTH(Name) IN (2,15)
  )
  SELECT * FROM length_names
  GROUP BY length_name
  HAVING MAX(num_babies);

 * sqlite:///baby_names.db
Done.

[('Ty', 2, 29205), ('Franciscojavier', 15, 52)]

## Task 3
The founder of Maven Analytics is named Chris. Find the state with the highest percent of babies named "Chris"

In [117]:
%%sql
  WITH state_total_names AS(
    SELECT State, SUM(Births) as num_babies FROM names
    GROUP BY State
  ),
  state_chris_total as (
    SELECT State, SUM(Births) as num_chris FROM names
    WHERE Name = 'Chris'
    GROUP BY State
  )

  SELECT sc.State, ROUND(CAST(sc.num_chris AS REAL) / st.num_babies * 100,4) as percent_chris
  FROM state_chris_total sc
  INNER JOIN state_total_names st
  ON sc.State = st.State;

 * sqlite:///baby_names.db
Done.

[('AL', 0.0143),
 ('AR', 0.0156),
 ('AZ', 0.0186),
 ('CA', 0.0268),
 ('CO', 0.015),
 ('CT', 0.0136),
 ('DC', 0.0115),
 ('DE', 0.0041),
 ('FL', 0.0209),
 ('GA', 0.0199),
 ('HI', 0.0301),
 ('IA', 0.0072),
 ('ID', 0.0022),
 ('IL', 0.0162),
 ('IN', 0.0119),
 ('KS', 0.0124),
 ('KY', 0.0105),
 ('LA', 0.0335),
 ('MA', 0.0124),
 ('MD', 0.0188),
 ('ME', 0.0055),
 ('MI', 0.0125),
 ('MN', 0.0123),
 ('MO', 0.0108),
 ('MS', 0.0125),
 ('MT', 0.0046),
 ('NC', 0.0188),
 ('ND', 0.0079),
 ('NE', 0.007),
 ('NJ', 0.025),
 ('NM', 0.0152),
 ('NV', 0.0151),
 ('NY', 0.0296),
 ('OH', 0.0088),
 ('OK', 0.0183),
 ('OR', 0.0083),
 ('PA', 0.0115),
 ('SC', 0.0128),
 ('SD', 0.0033),
 ('TN', 0.0139),
 ('TX', 0.028),
 ('UT', 0.0109),
 ('VA', 0.0196),
 ('WA', 0.0135),
 ('WI', 0.0069),
 ('WV', 0.0018)]

In [118]:
con.close()